[{
    "batch_input_shape": [null, 120, 160, 3],
    "dtype": "float32",
    "sparse": false,
    "name": "input_2"
}, {
    "name": "model_1",
    "layers": [{
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
            "batch_input_shape": [null, 120, 160, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
        },
        "inbound_nodes": []
    }, {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [null, 120, 160, 3],
            "dtype": "float32",
            "filters": 2,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["input_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "activation_1",
        "class_name": "Activation",
        "config": {
            "name": "activation_1",
            "trainable": true,
            "activation": "relu"
        },
        "inbound_nodes": [
            [
                ["batch_normalization_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "max_pooling2d_1",
        "class_name": "MaxPooling2D",
        "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "pool_size": [3, 3],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["activation_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "dropout_1",
        "class_name": "Dropout",
        "config": {
            "name": "dropout_1",
            "trainable": true,
            "rate": 0.05,
            "noise_shape": null,
            "seed": null
        },
        "inbound_nodes": [
            [
                ["max_pooling2d_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_2",
            "trainable": true,
            "filters": 4,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["dropout_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
            "name": "batch_normalization_2",
            "trainable": true,
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "activation_2",
        "class_name": "Activation",
        "config": {
            "name": "activation_2",
            "trainable": true,
            "activation": "relu"
        },
        "inbound_nodes": [
            [
                ["batch_normalization_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "max_pooling2d_2",
        "class_name": "MaxPooling2D",
        "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "pool_size": [3, 3],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["activation_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "dropout_2",
        "class_name": "Dropout",
        "config": {
            "name": "dropout_2",
            "trainable": true,
            "rate": 0.05,
            "noise_shape": null,
            "seed": null
        },
        "inbound_nodes": [
            [
                ["max_pooling2d_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_3",
            "trainable": true,
            "filters": 8,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["dropout_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
            "name": "batch_normalization_3",
            "trainable": true,
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "activation_3",
        "class_name": "Activation",
        "config": {
            "name": "activation_3",
            "trainable": true,
            "activation": "relu"
        },
        "inbound_nodes": [
            [
                ["batch_normalization_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "max_pooling2d_3",
        "class_name": "MaxPooling2D",
        "config": {
            "name": "max_pooling2d_3",
            "trainable": true,
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["activation_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "dropout_3",
        "class_name": "Dropout",
        "config": {
            "name": "dropout_3",
            "trainable": true,
            "rate": 0.05,
            "noise_shape": null,
            "seed": null
        },
        "inbound_nodes": [
            [
                ["max_pooling2d_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_4",
            "trainable": true,
            "filters": 16,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["dropout_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "batch_normalization_4",
        "class_name": "BatchNormalization",
        "config": {
            "name": "batch_normalization_4",
            "trainable": true,
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "activation_4",
        "class_name": "Activation",
        "config": {
            "name": "activation_4",
            "trainable": true,
            "activation": "relu"
        },
        "inbound_nodes": [
            [
                ["batch_normalization_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "max_pooling2d_4",
        "class_name": "MaxPooling2D",
        "config": {
            "name": "max_pooling2d_4",
            "trainable": true,
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["activation_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "dropout_4",
        "class_name": "Dropout",
        "config": {
            "name": "dropout_4",
            "trainable": true,
            "rate": 0.05,
            "noise_shape": null,
            "seed": null
        },
        "inbound_nodes": [
            [
                ["max_pooling2d_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_5",
            "trainable": true,
            "filters": 24,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "linear",
            "use_bias": false,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["dropout_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "batch_normalization_5",
        "class_name": "BatchNormalization",
        "config": {
            "name": "batch_normalization_5",
            "trainable": true,
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_5", 0, 0, {}]
            ]
        ]
    }, {
        "name": "activation_5",
        "class_name": "Activation",
        "config": {
            "name": "activation_5",
            "trainable": true,
            "activation": "relu"
        },
        "inbound_nodes": [
            [
                ["batch_normalization_5", 0, 0, {}]
            ]
        ]
    }, {
        "name": "max_pooling2d_5",
        "class_name": "MaxPooling2D",
        "config": {
            "name": "max_pooling2d_5",
            "trainable": true,
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [2, 2],
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["activation_5", 0, 0, {}]
            ]
        ]
    }],
    "input_layers": [
        ["input_1", 0, 0]
    ],
    "output_layers": [
        ["max_pooling2d_5", 0, 0]
    ]
}, {
    "name": "flatten_1",
    "trainable": true,
    "data_format": "channels_last"
}, {
    "name": "dropout_5",
    "trainable": true,
    "rate": 0.2,
    "noise_shape": null,
    "seed": null
}, {
    "name": "dense_1",
    "trainable": true,
    "units": 25,
    "activation": "linear",
    "use_bias": false,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}, {
    "name": "batch_normalization_6",
    "trainable": true,
    "axis": -1,
    "momentum": 0.99,
    "epsilon": 0.001,
    "center": true,
    "scale": true,
    "beta_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "gamma_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "moving_mean_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "moving_variance_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "beta_regularizer": null,
    "gamma_regularizer": null,
    "beta_constraint": null,
    "gamma_constraint": null
}, {
    "name": "activation_6",
    "trainable": true,
    "activation": "tanh"
}, {
    "name": "dense_2",
    "trainable": true,
    "units": 12,
    "activation": "linear",
    "use_bias": false,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}, {
    "name": "batch_normalization_7",
    "trainable": true,
    "axis": -1,
    "momentum": 0.99,
    "epsilon": 0.001,
    "center": true,
    "scale": true,
    "beta_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "gamma_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "moving_mean_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "moving_variance_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "beta_regularizer": null,
    "gamma_regularizer": null,
    "beta_constraint": null,
    "gamma_constraint": null
}, {
    "name": "activation_7",
    "trainable": true,
    "activation": "tanh"
}, {
    "name": "dense_3",
    "trainable": true,
    "units": 9,
    "activation": "linear",
    "use_bias": false,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}, {
    "name": "batch_normalization_8",
    "trainable": true,
    "axis": -1,
    "momentum": 0.99,
    "epsilon": 0.001,
    "center": true,
    "scale": true,
    "beta_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "gamma_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "moving_mean_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "moving_variance_initializer": {
        "class_name": "Ones",
        "config": {}
    },
    "beta_regularizer": null,
    "gamma_regularizer": null,
    "beta_constraint": null,
    "gamma_constraint": null
}, {
    "name": "activation_8",
    "trainable": true,
    "activation": "tanh"
}, {
    "name": "dense_4",
    "trainable": true,
    "units": 1,
    "activation": "tanh",
    "use_bias": false,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}]