[{
    "batch_input_shape": [null, 120, 160, 3],
    "dtype": "float32",
    "sparse": false,
    "name": "input_1"
}, {
    "name": "model_1",
    "layers": [{
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
            "batch_input_shape": [null, 120, 160, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
        },
        "inbound_nodes": []
    }, {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [null, 120, 160, 3],
            "dtype": "float32",
            "filters": 4,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["input_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_2",
            "trainable": true,
            "filters": 8,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_1", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_3",
            "trainable": true,
            "filters": 16,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_2", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_4",
            "trainable": true,
            "filters": 32,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_3", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_5",
            "trainable": true,
            "filters": 64,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_4", 0, 0, {}]
            ]
        ]
    }, {
        "name": "conv2d_6",
        "class_name": "Conv2D",
        "config": {
            "name": "conv2d_6",
            "trainable": true,
            "filters": 128,
            "kernel_size": [5, 5],
            "strides": [2, 2],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["conv2d_5", 0, 0, {}]
            ]
        ]
    }, {
        "name": "flatten_1",
        "class_name": "Flatten",
        "config": {
            "name": "flatten_1",
            "trainable": true,
            "data_format": "channels_last"
        },
        "inbound_nodes": [
            [
                ["conv2d_6", 0, 0, {}]
            ]
        ]
    }, {
        "name": "dense_1",
        "class_name": "Dense",
        "config": {
            "name": "dense_1",
            "trainable": true,
            "units": 50,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                    "scale": 1.0,
                    "mode": "fan_avg",
                    "distribution": "uniform",
                    "seed": null
                }
            },
            "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
        },
        "inbound_nodes": [
            [
                ["flatten_1", 0, 0, {}]
            ]
        ]
    }],
    "input_layers": [
        ["input_1", 0, 0]
    ],
    "output_layers": [
        ["dense_1", 0, 0]
    ]
}, {
    "name": "dense_2",
    "trainable": true,
    "units": 512,
    "activation": "relu",
    "use_bias": false,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}, {
    "name": "reshape_1",
    "trainable": true,
    "target_shape": [2, 4, 64]
}, {
    "name": "conv2d_transpose_1",
    "trainable": true,
    "filters": 64,
    "kernel_size": [5, 5],
    "strides": [2, 2],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null,
    "output_padding": null
}, {
    "name": "zero_padding2d_1",
    "trainable": true,
    "padding": [
        [1, 1],
        [1, 1]
    ],
    "data_format": "channels_last"
}, {
    "name": "conv2d_transpose_2",
    "trainable": true,
    "filters": 32,
    "kernel_size": [5, 5],
    "strides": [2, 2],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null,
    "output_padding": null
}, {
    "name": "zero_padding2d_2",
    "trainable": true,
    "padding": [
        [1, 1],
        [0, 0]
    ],
    "data_format": "channels_last"
}, {
    "name": "conv2d_transpose_3",
    "trainable": true,
    "filters": 16,
    "kernel_size": [5, 5],
    "strides": [2, 2],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null,
    "output_padding": null
}, {
    "name": "zero_padding2d_3",
    "trainable": true,
    "padding": [
        [1, 1],
        [0, 0]
    ],
    "data_format": "channels_last"
}, {
    "name": "conv2d_transpose_4",
    "trainable": true,
    "filters": 8,
    "kernel_size": [5, 5],
    "strides": [2, 2],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null,
    "output_padding": null
}, {
    "name": "conv2d_transpose_5",
    "trainable": true,
    "filters": 4,
    "kernel_size": [5, 5],
    "strides": [2, 2],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null,
    "output_padding": null
}, {
    "name": "conv2d_7",
    "trainable": true,
    "filters": 3,
    "kernel_size": [3, 3],
    "strides": [1, 1],
    "padding": "same",
    "data_format": "channels_last",
    "dilation_rate": [1, 1],
    "activation": "relu",
    "use_bias": true,
    "kernel_initializer": {
        "class_name": "VarianceScaling",
        "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
        }
    },
    "bias_initializer": {
        "class_name": "Zeros",
        "config": {}
    },
    "kernel_regularizer": null,
    "bias_regularizer": null,
    "activity_regularizer": null,
    "kernel_constraint": null,
    "bias_constraint": null
}]